logs/ycsb/20251117_0200/cpu_workloadf_run.log
/usr/bin/java  -classpath /home/ldy/src/YCSB/conf:/home/ldy/src/YCSB/core/target/core-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/rocksdb-binding-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/rocksdbjni-5.11.3.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/workloads/workloadf -threads 40 -p operationcount=5000000 -p rocksdb.dir=/mnt/test
Command line: -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/workloads/workloadf -threads 40 -p operationcount=5000000 -p rocksdb.dir=/mnt/test
YCSB Client 0.17.0

Loading workload...
Starting test.
[Thread-34] INFO site.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /mnt/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
[OVERALL], RunTime(ms), 52401
[OVERALL], Throughput(ops/sec), 95418.0263735425
[TOTAL_GCS_G1_Young_Generation], Count, 59
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 149
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.28434571859315666
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 59
[TOTAL_GC_TIME], Time(ms), 149
[TOTAL_GC_TIME_%], Time(%), 0.28434571859315666
[READ], Operations, 5000000
[READ], AverageLatency(us), 152.9980324
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 650239
[READ], 95thPercentileLatency(us), 399
[READ], 99thPercentileLatency(us), 513
[READ], Return=OK, 5000000
[READ-MODIFY-WRITE], Operations, 2500827
[READ-MODIFY-WRITE], AverageLatency(us), 637.8917845976551
[READ-MODIFY-WRITE], MinLatency(us), 20
[READ-MODIFY-WRITE], MaxLatency(us), 651263
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 1280
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 2679
[CLEANUP], Operations, 40
[CLEANUP], AverageLatency(us), 9737.425
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 389375
[CLEANUP], 95thPercentileLatency(us), 22
[CLEANUP], 99thPercentileLatency(us), 389375
[UPDATE], Operations, 2500827
[UPDATE], AverageLatency(us), 478.61814591733054
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 127359
[UPDATE], 95thPercentileLatency(us), 1101
[UPDATE], 99thPercentileLatency(us), 2505
[UPDATE], Return=OK, 2500827